#include <string>
#include <stdio.h>
#include <iostream>

using namespace std;
int main()
{
// Написать программу, которая помещает в переменную str часть строки длиной не более 8 символов и оканчивающую буквой g
    string str,str1;
    cout << "Введите текст строки\n";
    cin >> str;
    scanf("%7s",str1);
    printf("%s",str);
}

