'''
Вычислите z = x^4 -y^2*x^2 + 7x -3 
'''
x = int(input('Значение x = '))
y = int(input('Значение y = '))

z = ((x**4)-((x**2)*(y**2))+(7*x)-3)**(1/(abs(x)))

print('Значение x = ',z)